---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintFixedSegmentDir
source: html/25901dcf-7002-27dc-6ac1-2db16bc2ce23.htm
---
# RebarShapeConstraintFixedSegmentDir Methods

Return the Id of the parameter associated with this constraint.